package curriculum_A;

public class Qes1_13 {
public static void main(String[] args) {
/**********************************************************************************
下記9個をローカル変数として宣言のみしてください
 ・バイト型・短整数型・整数型・長整数型
 ・単精度浮動小数点数型・倍精度浮動小数点数型
 ・文字型・文字列型
 ・ブーリアン型
 それぞれのローカル変数をローカル内でそれぞれの初期値を代入し初期化してください
**********************************************************************************/
// ブーリアン型の初期値を設定
boolean bo = false;
// 文字列型の初期値を設定初期を設定
char c = '\u0000';
// 文字列型の初期値を設定
String st = null;
// バイト型の初期値を設定
byte by = 0;
// 短整数型の初期値を設定
short sh =0;
// 整数型の初期値を設定
int in = 0;
// 長整数型の初期値を設定
long lo = 0;
// 単精度浮動小数点数型の初期値を設定
float fl = 0.0f;
// 倍精度浮動小数点数型の初期値を設定
double dou =0.0;
/**********************************************************************************
初期化をしたそれぞれの変数に下記の値を代入してください		
・バイト型		10
・短整数型		100
・整数型		1000
・長整数型		10000
・単精度浮動小数点数型		9.5
・倍精度浮動小数点数型		10.5
・文字型		a
・文字列型		ハロー
・ブーリアン型		true
**********************************************************************************/
// ブーリアン型にtrueを代入
bo = true;
// 文字型にaを代入
c = 'a';
//　文字列型にハローを代入
st = "ハロー";
// バイト型に10を代入
by = 10;
// 短整数型に100を代入
sh = 100;
// 整数型に1000を代入
in = 1000;
// 長整数型に10000を代入
lo = 10000;
// 単精度浮動小数点数型に9.5を代入
fl = 9.5F;
// 倍精度浮動小数点数型に10.5を代入
dou = 10.5;
/**********************************************************************************
下記の通りにコンソール出力されるようにしてください
上記で作成した変数を必ず使用すること
11110
20
a ハロー true
11130
10000000000
0.105
-90
**********************************************************************************/
//整数の合計
System.out.println(by + sh + in +lo);
//バイト型を二回足す
System.out.println(by + by);
//文字列とブーリアンの出力
System.out.println(c+" "+st+" "+bo);
//数字の合計
System.out.println(by + sh + in +lo + fl + dou);
//小数点以外の数字を全てかける
System.out.println(by * sh * in *lo);
//10.5割る100をする
System.out.println(dou / sh);
//10引く100をする
System.out.println(by - sh);
/*-------------------------------------------------------------------------
次のプログラムを実行すると「ハローJAVA2023」という結果が表示されます。
「ハローJAVA43」と表示とさせたいのですが、意図通りに動きません。正しく動作するように修正してください。
-------------------------------------------------------------------------*/
//numに20を代入
int num=20;
//num1に23を代入
int num1=23;
//ハローJAVA43を表示
System.out.println("ハローJAVA"+(num+num1));
/*-------------------------------------------------------------------------
『』で囲われた人の情報を変数にして、formatの通りコンソールに出力してください
ローカル変数に代入し○○に入れてください
『山田太郎 18歳 170.5cm 62.2kg 寿司』
-------------------------------------------------------------------------*/
//名前
String name ="山田太郎";
// 歳
int age =18;
// 身長
double hi =170.5;
// 体重
float kg =62.2F;
// 好きな食べ物
String gohan ="寿司";
//自己紹介文を出力する処理
System.out.println("初めまして"+name+"です");
System.out.println("年齢は"+age+"歳です");
System.out.println("身長は"+hi+"cmです");
System.out.println("体重は"+kg+"kgです");
System.out.println("好きな食べ物は"+gohan+"です");
/*-------------------------------------------------------------------------
6で作成した自己紹介に続いてBMIが出力されるようにしてください
「BMIは○○です」
ただし計算は数値を直書きせず、全て変数を使ってすること
-------------------------------------------------------------------------*/
double bmi =kg / (hi * hi /10000);
// BMI出力
System.out.println("BMIは"+String.format("%.1f", bmi)+"です");
/*-------------------------------------------------------------------------
6で宣言した変数に再代入し下記の通りコンソールに出力してください
　初めまして鈴木一郎です
　年齢は24歳です
　身長168.5cmです
　体重は64.2kgです
　好きな食べ物はオムライスです
　BMIは22.6です
-------------------------------------------------------------------------*/
// 名前
name ="鈴木一郎";
//年齢
age =24;
// 身長
hi =168.5;
// 体重
kg =64.2F;
// 好きな食べ物
gohan ="オムライス";
//自己紹介文を出力する処理
System.out.println("初めまして"+name+"です");
System.out.println("年齢は"+age+"歳です");
System.out.println("身長は"+hi+"cmです");
System.out.println("体重は"+kg+"kgです");
System.out.println("好きな食べ物は"+gohan+"です");
// BMI出力
bmi =kg / (hi * hi /10000);
//コンソールに出力
System.out.println("BMIは"+String.format("%.1f", bmi)+"です");
/*-------------------------------------------------------------------------
8で使用した変数【年齢・身長・体重】の数値を和算で自己代入し、下記の通りコンソールに出力してください
　初めまして鈴木一郎です
　年齢は48歳です
　身長337.0cmです
　体重は128.4kgです
　好きな食べ物はオムライスです
　BMIは11.31です
-------------------------------------------------------------------------*/
//【年齢・身長・体重】の数値を和算で自己代入
age =age + age;
hi =hi +hi;
kg =kg + kg;
//自己紹介文を出力する処理
System.out.println("初めまして"+name+"です");
System.out.println("年齢は"+age+"歳です");
System.out.println("身長は"+hi+"cmです");
System.out.println("体重は"+kg+"kgです");
System.out.println("好きな食べ物は"+gohan+"です");
// BMI出力
bmi =kg / (hi * hi /10000);
System.out.println("BMIは"+String.format("%.1f", bmi)+"です");
/*-------------------------------------------------------------------------
8で使用した年齢が25歳以上ならtrueが出力されるようにしてください。ただしif文は使いません
-------------------------------------------------------------------------*/
 // boolean型の変数を宣言
boolean isOverTeenage;
// 【条件式】
age = 24;
isOverTeenage = (age >= 25);
System.out.println(isOverTeenage);
/*-------------------------------------------------------------------------
8で使用した【年齢・身長・体重】を文字列型に型変換し繋げて出力してください
-------------------------------------------------------------------------*/
// 文字列型に型変換
String str = String.valueOf(age);
// 文字列型に型変換
String strs = String.valueOf(hi);
// 文字列型に型変換
String strss = String.valueOf(kg);
//コンソールに出力
System.out.println(str+ strs + strss);
/*-------------------------------------------------------------------------
11で変換した【年齢・身長】を整数型に変換して出力してください
-------------------------------------------------------------------------*/
// 整数型に変換
int age2 = Integer.parseInt(str);
// 整数型に変換
float hi2 = Float.parseFloat(strs);
//身長体重の出力
System.out.println(age2);
System.out.println(hi2);
/*-------------------------------------------------------------------------
12で変換した【年齢・身長】で【年齢が25もしくは身長が160以上】であればtrueを出力してください
ただしif文は使わないでください
-------------------------------------------------------------------------*/
// boolean型の変数を宣言
boolean isOverTeenage2;
// 【条件式】
isOverTeenage2 = (age2 >= 25 || hi2 >= 160);
//コンソールに出力
System.out.println(isOverTeenage2);
}
}
